[
  {
    "id": "0",
    "name": "曹操",
    "nameZi": "字孟德",
    "img": "/dist/img/san/face/caocao.png",
    "romance": "曹操是《三国演义》中塑造得最为成功的人物之一，他的性格既丰富又矛盾。他既是智谋机警，志大才高的英雄；同时又是一奸诈狡猾，嗜血残忍之奸雄。曹操因而被评为“古今奸雄中的第一奇人”。罗贯中对曹操这一矛盾形象的雕塑非常深刻，摆脱了早期小说中人物形象性格单一化、平面化的缺陷。",
    "history": "曹操（155年－220年3月15日），字孟德，小名吉利，小字阿瞒，沛国谯（今安徽省亳州市）人。中国东汉末年著名军事家、政治家和诗人，三国时代魏国奠基者和主要缔造者。曹操在世时官至汉丞相，爵至魏王；去世后，谥号武王。其子曹丕称帝后，追尊其为武皇帝，庙号太祖。曹操为人机智，聪明，但也狡猾、多疑，可是也有很多人看好曹操的才华，如陈寿的“抑可谓非常之人，超世之杰矣”及许劭的“子治世之能臣，乱世之奸雄”已明显阐述曹操的才能非比常人。但也有许多人瞧不起曹操的品德，孙盛曰：魏武于是失政刑矣。易称“明折庶狱”，传有“举直措枉”，庶狱明则国无怨民，枉直当则民无不服，未有征青蝇之浮声，信浸润之谮诉，可以允釐四海，惟清缉熙者也。昔者汉高狱萧何，出复相之，玠之一责，永见摈放，二主度量，岂不殊哉 ！曹操会武艺，甚至有一次偷进张让家时被发现，曹操手挥舞戟才得以逃跑，曹操也有抱负着野心的态度来面对乱世,如其迎接刘协代表其掌控了汉朝大势，使到汉献帝刘协也没有权利。曹操也是残忍之者，时常屠城[30]，所以曹操杀人亦不手软，坑杀士卒、弑害皇后皇子等宗室，曹操更过度劳役人民，以致时常爆发起义。石勒批评曹操“大丈夫行事当礌礌落落，如日月皎然，终不能如曹孟德、司马仲达父子，欺他孤儿寡妇，狐媚以取天下也。”曹操妻子众多，一次收降张绣时，因为贪色，收了张绣伯母入侧室，引来张绣不快，曹操得知后于是想杀害张绣，但是由于计划泄漏，引起张绣兵变，其长子曹昂，侄儿曹安民以及典韦白白地牺牲。虽说好色，但曹操纳妾实际上是有所标准，综观曹操所收的人妻，不是寡妇，就是别人休离的前妻，所以曹操才不齿吕布的所为。在《三国志·魏书·崔琰传》记载其性忌，凡是有得罪之处都一律杀死，例如:崔琰、许攸、娄圭、孔融、杨修、华佗、边让、桓邵、刘勋等人，即使没犯错只要威胁到曹操，曹操亦杀之，神童周不疑便是最好的例子。从政治，军事，经济来看都是略胜一筹的。然而也是个卓越的军事家，在战略，战术方面都能应付裕如，常用计略来应付一系列的群雄战争来取胜，然而曹操也是喜欢兵法，甚至还为孙武(孙子)所著作的《孙子兵法》做过注释。张绣兵变复投曹营后不出几年便病故，不然一般认为张绣若活得够久早晚遭曹操清算。曹操的性格是有两面性的，从《让县自明本志令》中可以看出曹操有政治智慧，也有性情。这样一份有重要政治意义的纲领性文件却用了非常朴实的语言风格，以及他的遗嘱中很少提及他的政治生涯，很大篇幅都是安排琐碎的家务事，虽说苏东坡曾对此评价“平生奸伪，死见真性”，但“惟大英雄能本色，是真名士自风流”，可见他的性情，另一方面，他也是奸猾的、容易猜忌的，他以《让县自明本志令》表明忠心，但实际行动却浑然不同，在不同的实例中可以看出曹操的不同性格，但复杂的性格融与他一身正说明了他的大气。设计发丘中郎将、摸金校尉等职，专门盗墓掘坟以赚取军费，行事风格非常干脆实际。"
  },
  {
    "id": "1",
    "name": "刘备",
    "nameZi": "字玄德",
    "img": "/dist/img/san/face/liubei.png",
    "romance": "小说《三国演义》为塑造人物性格，将刘备描写成极仁爱的君主，但却爱哭，甚至有歇后语说：“刘备的江山 ——哭出来的”，基本上有关三国的歇后语，多为演义，比方“刘备摔阿斗──收买人心”，然则史实上并无摔阿斗，此外演义为衬托诸葛亮、关羽等人才能，贬低了刘备军事之能，亦也修饰枭雄刘备较令人垢病的一面。且《三国志》记载刘备“喜怒不形于色”，据史可考的哭泣次数也远少于曹操、孙权，反而是较血气方刚、蛮勇豪迈之人。《三国演义》虚构了从刘胜到刘备的每一代家谱，称献帝核对家谱后发现刘备按辈分是自己的叔父，尊称刘备为皇叔，《三国演义》也多处用“刘皇叔”指代刘备。事实上若将《三国演义》所记家谱对照汉朝君主世系，刘备当为献帝孙辈。且《三国志》等史料并未详细记载刘备世系，也无载献帝尊刘备为皇叔之事。",
    "history": "刘备（161年－223年6月10日），字玄德，涿郡涿县（今河北省涿州市）人，三国时期蜀汉开国皇帝，谥号昭烈皇帝，史家又称为先主，而其子刘禅则被称为“后主”。刘备沉默寡言，喜怒不形于色，常以谦虚恭敬待人，只是情感很少表露于外。深知“得人心者得天下”的道理，重视以宽仁厚德待人，与那些残民以逞、暴虐嗜杀的军阀判然有别，因此而争取到了人心。刘备不怎么喜欢读书，喜欢评马论犬、音乐和华美的衣物。小时候，家中有棵大桑树，遥望见如同车盖，刘备与宗中小儿于树下玩耍时说过：“吾必当乘此羽葆盖车。（我必定当会乘此羽饰华盖的之车。）”叔父听到后，不禁当下斥责他：“汝勿妄语，灭吾门也。（你不要胡说，会招来灭门之祸）”刘备在部下声誉受损或是特殊的理由发生背叛的可能时往往站出来捍卫部下身誉保护部下家眷，徐庶母被抓，庶泪崩辞别刘备、糜芳背叛，刘备对愧疚的糜竺说兄弟罪不相及、夷陵之败黄权不得已降魏，刘备依然善待其家人“孤负黄权，权不负孤也。”刘备由于没有胡须，因此曾被张裕取笑。有一次，刘备与刘璋于涪县会面时，张裕时为璋从事，在一旁陪坐。由于裕的胡须浓密被备嘲笑说道：“过去吾在涿县时遇到好多姓毛的人，四方许多毛，涿县县令声称说：“许多毛(毛)绕涿(歜)而居。”，但裕立刻反唇相讥：“过去某人当上党郡潞县长，后来升任为涿县县令，其辞任归家时，有人写信给其，要是写了潞县就丢了涿县，而写上涿县又失去潞县，就写道“潞(露)涿(歜)君”。因此裕就用此方法反讥备。让刘备对张裕一直没什么好感，刘备攻汉中之前，张裕说会出师不利，但刘备仍照着既定计划出兵。结果刘备拿下汉中，不过两名大将吴兰、雷铜等也在此战中身亡，以致于刘备记恨张裕，某天，张裕私下对人说：“庚子年间（220年）会改朝换代；主公入主蜀地的九年后，也会再次失去蜀地，刘氏运气将会消尽。”谣言乱传，最终入刘备之耳，[17]刘备不满张裕散布灭亡谣言，以张裕的话语没有应验，把他关入狱中。诸葛亮请求刘备宽恕他，刘备只说：“芳兰生门，不得不鉏。”于是杀了张裕，弃尸于街头。刘备死前告诫其子刘禅的遗诏，其言辞恳切，令人莫不动容。文中，刘备劝刘禅最重要的一句话，便是“勿以恶小而为之，勿以善小而不为。惟贤惟德，能服于人。”古人教子，常以德为根基，因为唯有贤德之人，才能服人。刘备一生争战，乍看之下胜少败多。刘备攻打益州时，赵戬曾言：“刘备拙于用兵，每战必败。”认为刘备不会用兵，没本事拿下益州，傅干却说：“刘备得人心，又有诸葛亮、关羽、张飞等人杰辅助，怎会不济呢？”结果刘备果真取攻占益州。在荆州依附刘表时，曾建议刘表北伐曹操，刘表不接受。刘备住荆州数年，一次与刘表饮酒时起至厕所，见大腿赘肉生，慨然流涕。还坐，刘表奇怪问起刘备，刘备说：“我戎马半生，常常身不离鞍，大腿赘肉皆消。今天不复骑马，大腿赘肉生。日月若驰，老年快将至矣，而功业不能建立，是以为之悲叹。”"
  },
  {
    "id": "2",
    "name": "关羽",
    "nameZi": "字云长",
    "img": "/dist/img/san/face/guanyu.png",
    "romance": "章回小说《三国演义》总成过往传奇、野史、戏曲、地方世代说法、被官史避畏说法、说部话本及民间传说中关羽的故事，和史书中关羽的事迹有所出入，如关羽温酒斩华雄为汉末、魏晋以来的传说，按史华雄实为孙坚所杀；土山约三事是关羽战败而投降；文丑死因存见地方史料以及东晋王羲之父子的二王尺牍集和容斋随笔。而桃园结义、战吕布、过五关斩六将、战黄忠、手持青龙偃月刀、坐骑赤兔马、身高样貌等都为三国演义小说中所雕塑。而后人更引此形象将关羽神话，造就了民间偶像。《三国演义》对于关羽忠勇自负的性格也加以夸大、转嫁，如诸葛亮问关羽若曹、孙同时来侵(关羽惧怕吕蒙)，关羽回答要分兵拒之，关羽不满马超授官而起妒，改写为要入川与马超比武，关羽拒婚时骂孙权的儿子是犬子等等，都是小说的艺术创作",
    "history": "关羽（约160年?－220年）[1]，字云长，本字长生，司隶河东解人（今山西省运城市），约生于东汉桓帝延熹年间[2]，东汉末年三国时期刘备的重要将领。与张飞并称“万人敌”（见《三国志‧魏书‧程昱传》：“关羽、张飞皆万人敌也。”）。关羽最为特殊之处是其倍受中华文化历代推崇，由于其忠义勇武的形象，多被民众尊称为关公、关大爷、关老爷，又多次被后代帝王褒封，直至武圣，故也俗称为（关）圣帝、（关）帝君、（关）圣帝君、关帝、关帝爷等而流传至今。道教尊为协天大帝、伏魔大帝、翊汉天尊等，中国佛教界奉其为护法神之一，称为“伽蓝菩萨”。其中儒宗神教奉为五文昌之一而扶鸾信仰者则奉为恩主，故又称关公为恩主公、山西夫子、文衡圣帝。民间由于《三国演义》等传统作品的影响，普遍认为关羽与刘备、张飞义结金兰，关羽排行第二，故又俗称其为关二爷、关二哥。直至现当代的某些社会群体与场合中，仍然经常出现祭拜关公的情况。"
  },
  {
    "id": "3",
    "name": "吕布",
    "nameZi": "字奉先",
    "img": "/dist/img/san/face/lvbu.png",
    "romance": "《三国演义》描写他身高一丈，腰大（黄本为“阔”）十围，眉清目秀。持方天画戟（嘉靖本为画杆方天戟），骑赤兔马，头戴三叉束发紫金冠 、体挂西川红锦百花袍、身披兽面吞头连环铠、腰系勒甲玲珑狮蛮帯，弓箭随身。吕布被描写为汉末三国时代武艺最强之武将，“三英战吕布”时刘备、关羽、张飞三人围攻吕布，亦未能将其战倒；又直接写他成为丁原、董卓的义子，加上自己姓吕，所以张飞骂他是“三姓家奴”；加插了王允使计，以美女貂蝉离间他与董卓的“连环计”。",
    "history": "吕布（？－199年2月7日）[1]，字奉先，并州五原郡九原（今内蒙古包头九原区[注 1]）人，东汉末年著名武将与军阀。先后为丁原、董卓的部将，也曾为袁绍效力，后乘刘备与袁术交战时而占据徐州，自成一方势力。建安三年（公元199年）在下邳被曹操击败并处死。吕布臂力过人、善弓马骑射且骁勇善战，被认为堪比西汉名将李广，同样有“飞将”的美誉。该时民间有“人中吕布，马中赤兔”一说，并流传至今。不过吕布为人势利多变，多番易主弑主，有勇无谋且生性贪色，对高顺忠言明计不信不用，甚至纳部下妻妾为己有。故其勇武虽为人所忌，性格品行却并不为人所喜，人缘极差。"
  },
  {
    "id": "4",
    "name": "徐庶",
    "nameZi": "字元直",
    "img": "/dist/img/san/face/xushu.png",
    "romance": "在小说《三国演义》中，原为刘备的军师，助刘备破曹操军曹仁的八门金锁阵，之后曹操幕僚程昱献计，假托徐庶母笔迹，写信把徐庶骗到曹操阵营，徐母因见徐庶中了诡计，愤而自杀[2]，因此徐庶十分痛恨曹操，终生没有为曹操设任何一条计策[3]，民间有“徐庶进曹营：一言不发”的歇后语。之后，徐庶在赤壁之战前夕，遇见庞统，虽然识破了庞统将要使用“连环计”，但是他并未向曹操点破，而是脱离战场。徐庶在演义中有弟弟徐康，应为虚构。",
    "history": "徐庶，字元直，原名福，出身寒门单家，令小说《三国演义》将徐庶的本名误植为单福。豫州颍川长社（今河南许昌）人。中国东汉至三国时期人物。徐庶年少时好任侠击剑，初平时与石韬一同来到荆州，在荆州时与诸葛亮和庞统相交甚笃。刘备在新野时候，徐庶曾向刘备推荐诸葛亮。后来曹操征讨荆州，徐庶与刘备一同南下，因其母被曹军虏获，徐庶只好向刘备辞别并投靠曹操。徐庶投靠曹操后，黄初时为右中郎将、御史中丞，太和时诸葛亮出兵陇右，知道徐庶仕才如此，曾感叹地说：“魏殊多士邪！何彼二人不见用乎？（二人指徐庶与石韬，石韬曾与徐庶一同投靠曹操，黄初时为太守、典农校尉）”数年后徐庶病逝。"
  },
  {
    "id": "5",
    "name": "张郃",
    "nameZi": "字隽乂",
    "img": "/dist/img/san/face/zhanghe.png",
    "romance": "虽然罗贯中的《三国演义》是基于“拥刘反曹”的思想，在前期将张郃描写的有勇无谋。后期则将张郃英勇无比的形象突出描写，在九十九回中被诸葛亮围攻，一人拍马舞枪，冲出重围，在万军之中往来冲突，再在乱军中救出副将戴陵，连诸葛亮都称誉他勇武过人，更视其为蜀中之害，可见张郃为智勇双全的魏国名将。",
    "history": "张郃（？－231年），字儁乂，冀州河间国鄚（今中国河北省任丘市）人，是三国时期曹魏的名将，五子良将之一人。官至征西车骑将军，封鄚侯；死后，追封谥曰壮侯。以临场巧变见称，先后跟随韩馥，辗转跟随袁绍。在跟随袁绍时遭到谋士郭图的诬陷，所以转投曹操。在曹魏帐下常立功勋，后期抵御蜀国的表现出色，多次抵御诸葛亮北伐；刘备和诸葛亮及蜀国以下诸将都对其忌惮三分。张郃为将心思细密，精通历算，又擅长战场规划与谋略，在多次作战前必会分析敌我军势，然后再作详尽的谋略。在多次战役中显示张郃并不只是猛将一名，而张郃更能称得上智将。例如在袁曹的官渡大战、蜀魏的汉中战、定军山之战都荐举出不少计谋，又或是破谋等例如黄忠的“反客为主”之计、诸葛亮的“埋伏计”和算出蜀军急攻陈仓的粮数等。可见张郃的智谋并非池中物，连曹操都将之比拟为韩信。与韩信相比，二人有一些共同点：第一，两人同样精通历法；第二，两人同样善于算数；第三，两人皆为智将型的大将。此外，张郃虽为亦将爱乐儒士，尝荐同乡卑湛经明修行，诏曰：“昔祭遵为将，奏置五经大夫，居军中，与诸生雅歌投壶。今将军外勒戎旅，内存国朝。朕嘉将军之意，今擢湛为博士。”（被皇帝下诏嘉奖，将张郃比作爱好儒学的东汉大将祭遵，并将卑湛提升为博士。）[6]张郃亦善处理各种变数，善于安排阵营的布局，推算出战斗的情势及地形，无不如计，蜀军中自诸葛亮及以下的人都十分忌惮他。"
  },
  {
    "id": "6",
    "name": "张辽",
    "nameZi": "字文远",
    "img": "/dist/img/san/face/zhangliao.png",
    "romance": "在著名章回小说《三国演义》中的张辽，历程大概依循正史而为。《三国演义》有两个回目出现张辽的名字，分别是第五十三回《关云长义释黄汉升，孙仲谋大战张文远》，与及第六十七回《曹操平定汉中地，张辽威震逍遥津》。他先为吕布部将，多番令曹军陷于苦战，其武勇连关羽亦甚称道，他曾对张飞说：“此人（张辽）武艺，不在你我之下。”后来吕布战败遭擒，张辽亦成为战俘，于白门楼上表现刚烈，骂吕布为“匹夫”，大呼曹操为“国贼”，视死如归。曹操下令绞杀吕布后，刘备、关羽为张辽求情，曹操便待张辽以上宾之礼。张辽感其恩情，于是投降，自此成为曹操将领。第二十五回中，曹操在下邳城外的土山上包围关羽，张辽请缨劝说关羽暂降曹军，以报关羽白门楼相救之恩。关羽降曹期间，张辽一直担任曹操与关羽之间的协调者与斡旋者。后来关羽过五关斩六将，被夏侯惇追赶纠缠，亦赖张辽赶至拆解二人纷争，让关羽可以顺利离开曹营。张辽跟随曹操后，一直随军征讨，不久参与官渡之战，先后大战张郃，斩蒋奇，大败袁尚、沮鹄。在追击袁熙、袁尚时张辽受曹操任命，秉持军麾，担任首将，率领许褚、于禁、徐晃迎击乌桓军，张辽更亲斩乌桓单于蹋顿，建立诸多战功。曹操南下追击刘备于长坂时，张飞据桥拒守，并威胁曹操如不退兵便深入军中取其首级，曹操一时被其气焰吓退。张辽从后追上曹操，分析张飞只有一人，不足深惧，宜重新追击。赤壁之战时，张辽与许褚一起担任“护卫往来监战使”，当孙权军中的黄盖以诈降计发动火攻时，曹操形势艰险，张辽亲载小舟渡曹操脱难，并射伤黄盖。曹军战败撤退期间，张辽一直护卫著曹操，为其抵敌吕蒙、张飞，最后曹军受关羽堵截，张辽的出现令关羽动故旧之情，放过曹操，曹操才得免于难。赤壁战后，曹操命张辽为主将，引李典、乐进等守合肥，以御孙权。第五十三回中，孙权亲临合肥战线，与张辽经历多场战争，均未能攻克合肥，其将领太史慈更于此役中被张辽将计就计射杀。第六十七回，孙权乘曹操远在汉中的时机，再次引军进攻合肥，张辽在曹操密令的指示下，灵活调动军队，并亲自领军迎击孙权。最终大败孙权军队，更几乎擒住孙权。张辽因是役而威震逍遥津，名扬天下。最后，张辽随曹丕以大船征伐江东，军队被徐盛所击败。曹丕登岸逃亡时，吴将丁奉从岸边杀至，张辽为保护曹丕上前迎敌，却被丁奉以箭射其腰，回营后不治身亡，曹丕厚葬之。及至魏将曹真、司马懿主理对蜀战争之时，以张辽之子张虎及乐进之子乐綝二人为军锋，可惜二人表现平庸。",
    "history": "张辽（169年？－222年)，字文远，原为聂姓，并州雁门郡马邑县（今中国山西省朔州市朔城区大夫庄）人，三国时期曹魏名将，五子良将之一人；官至前将军，谥号为刚侯。原为西汉聂壹后人，因避怨而改姓。活跃于东汉末年，曾跟随丁原、董卓、吕布等军阀，后随曹操。公元215年，与李典、乐进以少量兵马驻守合肥城，面对东吴孙权亲征大军，以寡胜众，令孙权无功而返，甚至几乎擒住孙权。中国著名章回小说《三国演义》中的“威震逍遥津”情节，便是以此事为蓝本。张辽为人勇猛善战，多次战役都身先士卒，其合肥的勇武事迹令他留下“止啼”的威名。张辽为人也十分尽忠，当年关羽投于曹操营下，张辽与关羽为好友，曹操便派张辽问关羽去留之心，关羽表明只会跟随刘备，张辽想到如果照实说给曹操，怕曹操杀关羽。但不说，又不是事君之道，便叹息：“曹公，是如父亲般的君上；关羽，是兄弟而已。”最后选择了照实说给曹操。此举被后世认为是为臣下者懂分轻重、能识大体的表现，如南朝宋左仆射刘穆之曾说：“我蒙公（指刘裕）恩，义无隐讳，此张辽所以告关羽欲叛也。”[13]尚书右仆射何尚之亦曾言：“臣思张辽之言，关羽虽兄弟，曹公父子，岂得不言？”[14]此外，张辽感悟必改。当年他与护军武周不和。后来受胡质劝解，便与武周和好。[15]与李典、乐进等虽然有不和，但在面对东吴大军之际，同样能以大局为重。不只李典乐进，张辽任帅以来与之共同驻兵防守的副将皆有与张辽不睦的纪录，这在魏国高级将领中十分罕见。张辽亦十分重视部下，合肥役中，张辽率领部下闯进浩大的吴军部队中。张辽突击冲出，包围被打开缺口，张辽麾下的数十人得以逃出，其余军士呼唤道：“将军弃我乎!（将军抛弃我们了吗？）”张辽因此再度冲进包围网，再次突围救出其他人。"
  },
  {
    "id": "7",
    "name": "赵云",
    "nameZi": "字子龙",
    "img": "/dist/img/san/face/zhaoyun.png",
    "romance": "《三国演义》为明人罗贯中所著，他将《三国志平话》大幅改写，多以历史史实为基础，增加了元宋时说书话本和戏剧中的精彩部分，大幅扩充内容[22]，使《三国演义》成为中国小说史上影响力深远的巨著。罗贯中在《三国演义》中为赵云塑造的形象，是一名威武雄壮、武艺高强、忠义勇敢、贤慈爱民的武将。他一登场即和河北将领文丑大战，救了公孙瓒，曾和多名三国将领对战，冲锋陷阵从来未尝败绩，在长坂坡救阿斗时，连续杀死曹营将领十余员，还夺得有名宝剑曰“青釭剑”。子龙的骁勇善战，连敌人曹操都为之震撼，派曹洪问子龙之姓名，子龙曰：“吾乃常山赵子龙也！”曹操知道后，想要捉子龙并降之，于是下令军士不可放箭，但子龙还是逃回了刘备休憩处。智取桂阳时，更是展现了他过人的机智和出众的谋略。随诸葛亮吊祭周瑜时，因赵云带剑相随，吴将无人敢动诸葛亮。汉水救黄忠时，让魏国将领张郃、徐晃心惊胆战，不敢迎敌。刘备去世之后，曹魏五路犯蜀，赵云把守阳平关，一将当关，万夫莫开。七十几岁时仍为蜀军前锋，阵前斩杀被作者称为‘有万夫不当之勇’的西凉大将韩德一门五将。《三国演义》中刘备为汉中王时封赵云与关羽、张飞、马超、黄忠等五位将军为蜀汉的“五虎上将”，五虎将之名因此成为人人朗朗上口的三国勇将代名词。而赵云又有许多机智应变、忠君为民的出色表现，因此在《三国演义》中的赵云，其形象是文武双全、近乎完美无缺的。《三国演义》有赞赵云诗曰：红光罩体困龙飞，征马冲开长阪围，四十二年真命主，将军应得显神威。血染征袍透甲红，当阳谁敢与争锋，古来冲阵扶危主，只有常山赵子龙。昔日战长阪，威风犹未减。突阵显英雄，被围施勇敢。鬼哭与神号，天惊并地惨。常山赵子龙，一身都是胆。忆昔常山赵子龙，年登七十建奇功，独诛四将来冲阵，犹似当阳救主雄。常山有虎将，智勇匹关张。汉水功勋在，当阳姓字张。两番扶幼主，一念答先皇。青史书忠烈，应留百世芳。",
    "history": "赵云（生年不详－229年），字子龙，常山真定（今河北省正定县）人，身高八尺，姿颜雄伟，是三国时期蜀汉的名将。陈寿在撰写《三国志》的时候，将赵云与关羽、张飞、马超、黄忠的事迹合记成一传（《三国志·蜀书·关张马黄赵传》）在道教又称赵圣帝君.永昌君。赵云在《三国志》卷三十六，蜀志第六卷“关张马黄赵传”有传，由于蜀无史官[10]，陈寿选择史料又严谨，因此本传中关于赵云生平的记载仅有二百四十五字。 另外裴松之为《三国志》作注时，补注了《云别传》的大量资料，其中记载了赵云在求仁、秉公、忠君、慎行、论理、骁勇、受谥等各方面的事迹，让赵云的生平得以较完整的呈现给后人，历代的小说家、剧作家及说书人便是在此基础上，创作出了许多精彩的民间艺术作品，描绘出令后世喜爱的常山赵子龙。但亦有史学家认为《云别传》内容以史料而论并不严谨，所记载的内容皆是与赵云相关的轶事，且与《三国志》本身有所矛盾，真实性有待商榷。清朝义门先生何焯指出，刘备于221年准备东征吴国时，由身为将军的赵云，而非身为丞相的诸葛亮劝阻刘备不要东征，不合情理；另外，蜀汉于228年第一次北伐，赵云战败于箕谷后被贬，按常理，赵云所带领的部队不大可能得到赏赐，而诸葛亮却居然吩咐他分赐属下余绢，令人费解。故此他认为《云别传》是根据赵家家传改编，语多溢美。然而，此类观点并不多见考，并被一些史学者指过分疑古。"
  }
]